DavyLandman/p1-esp32/sdkconfig.defaults-esp32c3
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# performance
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_UART_ISR_IN_IRAM=y

# disable some stuff
CONFIG_ETH_USE_SPI_ETHERNET=n
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n
CONFIG_WS_TRANSPORT=n
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=1

# safe some space
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=n

# extra wifi stuff
CONFIG_LWIP_LOCAL_HOSTNAME="esp32-p1"
CONFIG_ESP_PHY_RF_CAL_FULL=y
CONFIG_ESP_WIFI_FTM_ENABLE=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_NAN_ENABLE=y
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n